using uLearn;

namespace OOP.Slides.U04_UI
{
	[Slide("Контролы", "6A57F8D70E2B429B8DF035796BDB8EDB")]
	public class S015_Controls
	{
		/*
		Первая, лежащая на поверхности проблема, которую нужно было решить — это дублирование кода.
		В разных программах встречаются одни и те же элементы интерфейса,
		поэтому естественным шагом было создания библиотеки повторно используемых 
		элементов управления (контролов). И для .NET и для Java существует несколько независимых библиотек контролов.

		![Контролы .NET](controls.png)

		В .NET предлагается знакомиться с концепциями проектирования UI на примере Windows Forms.
		Классы контролов находятся в сборке `System.Windows.Forms` в одноименном пространстве имен.
		
		При создании проекта в VS с типом Windows Forms Application, эта сборка автоматически подключается в References.

		Базовое представление об этой библиотеке можно получить из этого 
		[туториала](http://msdn.microsoft.com/ru-ru/library/dd492135.aspx).
		
		В Java предлагается использовать стандартную библиотеку swing.
		Небольшой курс знакомства со swing можно [найти тут](http://zetcode.com/tutorials/javaswingtutorial/).
		*/

	}
}