using uLearn;

namespace OOP.Slides.U04_UI
{
	[Slide("Задача: Простой интерфейс", "65F74731FBAA4655A4848DF048086033")]
	public class S030_SimpleUITask
	{
		/*
		Цель этого задания — освоиться с базовыми контролами и механизмами размешения элементов на форме.
		Создайте одно окно с интерфейсом редактирования свойств какого-либо объекта.

		Вы должны использовать как минимум четыре различных интерактивных 
		элемента управления (кнопка, список, выпадающий список, чек-бокс, радиокнопка, закладки, ...)

		Вы должны продемонстрировать умение управлять позиционированием контролов 
		при изменении размеров окна.

		Вы должны продемонстрировать умение задавать реакцию на действия с контролами — 
		нажатие на кнопки, изменение выделенного элемента в списке и т.п.

		### Не усложняйте

		Не усложняйте окно и его поведение. Сделайте небольшой пример, демонстрирующий, что вы со всем разобрались.
		Не стоит нагромождать слишком много элементов управления. 
		Не стоит делать слишком сложную логику у окна.

		###Примеры

		Свойства ноутбука в карточке товара для интернет магазина: 
		производитель, размер экрана, поколение процессора, наличие тач-экрана, тачпад/трэкпоинт, ...
		
		Данные о человеке: гражданство, имя, пол, возраст, семейное положение, имя супруга/супруги, ...

		Карточка супергероя в картотеке злодея: имя, происхождение, есть ли помощник, имя помощника,
		умения.

		Придумайте что-нибудь свое по аналогии.
		*/
	}
}