using uLearn;

namespace OOP.Slides.U05_UI2
{
	[Slide("Functions Explorer", "5CEC5548B6494911BF278032367D0F98")]
	public class S010_FunctionsExplorer
	{
		/*
		В этом модуле вам нужно будет реализовать приложение для демонстрации 
		графиков различных функций. 
		Вы можете выбрать сами, делать эти задачи либо на C# Windows Forms, либо на Java Swing.

		![mockup](mockup.png)

		Несколько комментариев о поведении интерфейса.

		При выборе типа функции в списке слева обновляется правая часть экрана.
		Она показывает график выбранной функции сверху и область настройки 
		параметров функции снизу.

		Кроме того, есть две кнопки:

		* `Open Chart` открывает новое окно, распахнутое во весь экран, содержащее только график функции.

		* `Save to list` добавляет новый пункт в список слева. 
		Для этого после нажатия на эту кнопку нужно спросить пользователя название.
		Этот новый пункт в списке отличается от того, из которого был создан только 
		названием и начальным значением параметров функции.
		*/
	}
}