using uLearn;

namespace OOP.Slides.U05_UI2
{
	[Slide("Задача: Список", "B1523938F3594D36B6D682723FC7C0CB")]
	public class S030_ListTask
	{
		/*
		На этой задаче вы должны освоиться с техникой разделения Представления и логики.

		![mockup](mockup-list.png)

		Реализуйте работу списка слева. 
		В результате для списка у вас должны получиться следующие классы:

		* класс Представления (удобно унаследовать его от контрола панели Panel или JPanel).
		* класс Контроллера, обновляющий вид (пока что только заголовок правой части окна)
			и реагирующий на действия пользователя в Представлении.
		* класс Модели — описаний типов функций.
		* простой тест, тестирующий контроллер.
		*/
	}
}