using uLearn;

namespace OOP.Slides.U05_UI2
{
	[Slide("Задача: Параметры", "B4F69CDE653E43B29BBDA81BB0EB217B")]
	public class S040_ParametersTask
	{
		/*
		В этой задаче отработайте взаимодействие разных контроллеров друг с другом.

		Для области редактирования параметров создайте ещё одну тройку:
		
		* Представление редактора параметров;
		* Модель FunctionModel, описывающую конкретные значения параметров и выбранный тип функции;
		* Контроллер для области редактирования параметров.

		![mockup](mockup-params.png)

		Напишите тест проверяющий работу связки контроллеров.
		*/
	}
}