using uLearn;

namespace OOP.Slides.U05_UI2
{
	[Slide("Задача: График", "03A7E98E5DEE460D8AC7448CB9AD0D57")]
	public class S060_ChartTask
	{
		/*
		Сделайте Представление, отображающее график функции.

		![mockup](mockup.png)

		Используйте его повторно, при обработке реакции на кнопку `Open Chart`. 
		Кнопка должна открывать немодальное окно, то есть окно, не блокирующее работу с родительским окном.

		Для обновления графика при изменении параметров используйте шаблон Observable.
		Для этого наделите модель FunctionModel умением всех заинтересованных подписываться на её изменения.

		Это позволит при редактировании параметров обновлять изображения графиков сразу во всех открытых окнах с графиками.

		Напишите тест проверяющий работу связки всех контроллеров и механизма Observable.
		*/
	}
}