namespace uLearn.Courses.BasicProgramming.Slides.U00_Basics
{
	[Slide("Краткая справка перед началом", "{69a2e121-e58f-4cd0-8221-7affb7dc796e}")]
	class S000_HelpSlide
	{
		/*
		**Слева** находится список всех слайдов курса, разбитый по тематическим модулям.
		
		Особыми значками в списке отмечены слайды с задачами и тестами.

		Под каждым видео будут краткие заметки, по которым вы можете быстро вспомнить содержание видео.

		После каждого видео вам предложат **решить одну или несколько небольших задач** на закрепление материала. 
		Решать эти задачи можно непосредственно в браузере, а специальная проверяющая система тут же проверит ваше решение.
		Известно, что лекционный материал гораздо лучше усваивается после применения на практике, поэтому не пренебрегайте решением задач.
		
		После успешного решения задачи вы сможете **посмотреть решения других обучающихся**. Иногда из них тоже можно чему-то научиться.

		Как только вы закончите изучение очередного слайда, 
		вы можете **оценить его качество** и **перейти на следующий слайд** с помощью блоков кнопок снизу.

		В путь!
		
		*/
	}
}
