namespace uLearn.Courses.BasicProgramming.Slides.U00_Basics
{
	[Slide("Hello world", "{7FB8D0CC-B551-485B-8D0B-37993D1B4B08}")]
	public class S01_HelloWorldVideo
	{
		//#video dYEutOH_dXA

		/*
		## Заметки по лекции

		Студенты УрФУ могут бесплатно получить Visual Studio через [Microsoft DreamSpark](http://dreamspark.ru).

		Вы также можете использовать [Xamarin Studio](http://xamarin.com) — альтернативную среду разработки на C#. 
		В отличие от Visual Studio, Xamarin работает и с другими операционными системами.
		
		Программы под .NET, благодаря технологии mono, запускаются под Linux и OS X, а также на мобильных устройствах.
		
		Кодовый файл — это один из файлов на языке C#.

		Проект — это совокупность кодовых файлов, которые могут быть скомпилированы в сборку: программу или библиотеку.

		Решение (solution) — это несколько проектов, объединенные общими библиотеками и задачами.
		Как правило открывать с помощью Visual Studio нужно именно файл решения (*.sln).

		Reference — ссылка внутри проекта на другие сборки, которые позволяют использовать сторонний код.
		
		Метод — это последовательность действий.

		Класс — это совокупность данных и методов. Все сборки состоят из скомпилированных классов.

		Пространство имен — это совокупность классов, логически связанных между собой. 
		
		Между сборками и пространствами имен нет прямого соответствия: в сборке может хранится несколько пространств имен, 
		а разные классы одного пространства имен могут быть определены в разных сборках.

		После успешной компиляции, в директории проекта создается поддиректория bin/Debug, в которой и оказывается результат компиляции — exe или dll файлы вашей программы.
	
		*/

		//#include _HelloWorld.cs
	}
}