using System;

namespace uLearn.Courses.BasicProgramming.Slides.U00_Basics
{
	[Slide("Числовые типы данных", "{f1953527-ac7a-4bb7-93fc-14bb9d2de249}")]
	public class S020_TypesVideo
	{
		//#video ooh2lcIxAmk

		/*
		## Заметки по лекции: типы данных
		*/

		class Program
		{
			static void Main()
			{
				//Переменная — это именованная область памяти.
				//
				//Тип переменной — это формат области памяти, определяющий множество возможных значений
				// переменной и множество допустимых операций над ней.

				int integerNumber;
				// так объявляется переменная: тип (int), затем имя (integerNumber)

				// так осуществляется присваивание           
				integerNumber = 10;

				// double - основной тип чисел с плавающей точкой.
				// Можно совмещать объявление и присваивание.
				double realNumber = 12.34;

				// float - тип меньшей точности.
				// Суффикс f говорит, что 1.234 - константа типа float, а не double.
				// Используются в библиотеках работы с графикой в Windows.
				float floatNumber = 1.234f;

				//long (большие целые числа). Используются в основном для подсчета миллисекунд.
				long longIntegerNumber = 3000000000000;

				// Есть и другие типы данных: short, decimal, и т.д.
				// В основном, для чисел вы будете пользоваться int и double, иногда - long и float
			}
		}

		/*
		## Заметки по лекции: конверсия типов
		*/
		class Program2
		{
			static void Main()
			{
				// Конверсия типов (cast) - это приведение переменных из одного типа в другой 

				int integerNumber = 45;
				double doubleNumber = 34.56;

				doubleNumber = integerNumber;
				// Это неявная конверсия типов: присвоение переменной одного типа 
				// значения переменной другого типа без дополнительных усилий. 
				// Она возможна, когда не происходит потери информации

				integerNumber = (int)doubleNumber;
				// Это явная конверсия типов. В случае, когда конверсия ведет к потере информации
				// (в данном случае - дробной части), необходимо явно обозначать свои намерения
				// по конверсии.


				integerNumber = (int)Math.Round(34.67);
				// Округление лучше всего делать не конверсией, а функцией Round. 
				// Кстати, Math - "математическая библиотека" C# - имеет множество других
				// полезных методов. 


				long longInteger = 4000000000;
				integerNumber = (int)longInteger;
				// При такой конверсии происходит ошибка переполнения, которая, однако, остается
				// незамеченной для компилятора и среды разработки


				// Таким образом можно отловить эти ошибки явно
				checked
				{
					integerNumber = (int)longInteger;
				}
			}
		}
		/*
		Вы можете познакомиться с полным списком встроенных типов данных в главе учебника по C#
		["Встроенные типы данных"](http://msdn.microsoft.com/ru-ru/library/cs7y5x0x(v=vs.90).aspx)
		*/
	}
}