namespace uLearn.Courses.BasicProgramming.Slides.U04_Arrays
{
	[Slide("Короткая форма записи", "{35FAAFF9-E319-4135-9A64-DA018601A605}")]
	public class S030_ShortForm
	{
		//#video 1HAWcDvZZFA
		/*
		## Заметки по лекции
		*/
		public static void Main()
		{
			//Как и с другими типами, можно использовать var и совместить объявление и инициализацию
			var array1 = new int[3];
			array1[0] = 1;
			array1[1] = 2;
			array1[2] = 3;

			//Можно записать так. Это тоже самое, что предыдущие 4 строки. 
			var array2 = new int[] { 1, 2, 3 };

			//Или даже так. Компилятор автоматически восстановит тип данных из типов констант 1, 2, 3.
			var array3 = new[] { 1, 2, 3 };

			//Это касается, конечно, всех типов, не только числовых.
			var array4 = new[] { "a", "b", "c" };

			//Здесь компилятор выдаст ошибку, поскольку он не может определить тип массива.
			//var array5 = new[] { 1, "2", 3 };

			//Но это можно исправить, если указать тип явно. object - это прародитель всех типов. 
			//Все есть object.
			var array6 = new object[] { 1, "2", 3 };
		}
	}
}